export const MENU = [
    {
        id: "menu-5",
        title: "خانه",
        name: "home",
        path: "/"
    },
    {
        id: "menu-4",
        title: "درباره‌ من",
        name: "about-me",
        path: "/about-me"
    },
    {
        id: "menu-3",
        title: "نمونه کارها",
        name: "portfolio",
        path: "/portfolio"
    },
    {
        id: "menu-2",
        title: "سئو",
        name: "seo",
        path: "/seo"
    },
    {
        id: "menu-1",
        title: "آموزش",
        name: "learn",
        path: "/learn"
    },
    {
        id: "menu-0",
        title: "کسب و کارها",
        name: "business",
        path: "/business"
    }
]

export const SEO_FAQ = [
    {
        id: `faq-0`,
        title: "برای رسیدن به رتبه 1 گوگل چقدر زمان لازم است؟",
        answer: "پاسخ به این سوال برای هر کسب و کار و سایتی متفاوت خواهد بود؛ بسته به میزان اعتبار و فعالیت های پیشین سایت شما، کلماتی که هدف گذاری کرده اید و وضعیت رقبا این زمان تعیین خواهد شد. ممکن است در یک حوزه بتوان در 3 ماه موفقیت های مهمی کسب کرد ولی در حوزه دیگری بیش از یک سال زمان لازم باشد."
    },
    {
        id: `faq-1`,
        title: "قیمت خدمات سئو چقدر است؟",
        answer: "سئو یک محصول نیست بلکه مجموعه ای از خدمات تخصصی است در نتیجه نمیتوان قیمت مشخصی برای همه سایت ها در نظر گرفت. البته میتوان خدمات سئو را در دسته بندی های مختلفی شامل بهینه سازی سایت، بازاریابی محتوا، لینک سازی و … قرار داد و برای هرکدام هزینه مشخصی اعلام نمود.",
        more: "قدم اول آنالیز دقیق سایت و تصمیم گیری در مورد خدمات مورد نیاز است که بر همین اساس میتوان تخمین درستی از قیمت ارائه نمود."
    },
    {
        id: `faq-2`,
        title: "چه تضمینی برای رسیدن به رتبه 1 گوگل دارید؟",
        answer: "یکی از مهمترین درخواست های کارفرما ارائه تضمین برای رسیدن به رتبه 1 در کلمات کلیدی هدف است در حالیکه این کار کاملا اشتباه و حتی غیرقانونی است. هیچ تضمینی برای تعیین دقیق رتبه شما در بازه زمانی مشخص وجود ندارد چرا که اطلاعاتی از آپدیت های بعدی گوگل و میزان فعالیت رقبا در دست نیست. در واقع ارائه تضمین به کارفرما شانس پذیرش پروژه را افزایش میدهد ولی همانطور که خود گوگل نیز بارها اعلام کرده است این روش نوعی از کلاه برداری است."
    }
] as any